In [16]:
import pandas as pd
import numpy as np
df = pd.read_csv('dataset/basic1.csv.xls')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [17]:
df.isnull().sum()/len(df) *100

id       0.0
age      0.0
city     0.0
f1      31.0
f2       0.0
f3      95.0
f4       0.0
f5       0.0
dtype: float64

In [18]:
print(df.shape)
df = df.drop(['f3'], axis = 1)
print(df.shape)

(100, 8)
(100, 7)

In [19]:
df.city.unique()

array(['서울', '부산', '대구', '경기'], dtype=object)

In [20]:
a = df[df.city =='서울'].f1.median()
b = df[df.city =='부산'].f1.median()
c = df[df.city =='대구'].f1.median()
d = df[df.city =='경기'].f1.median()
print(a, b, c, d)

68.0 62.0 75.0 58.0

In [24]:
df['f1'] = df['f1'].fillna(df['city'].map({'서울':a, '부산':b, '대구':c, '경기':d}))
df[18:21]

      id   age city    f1  f2    f4         f5
18  id19  53.0   서울  68.0   0  ISFP  83.685380
19  id20  11.0   서울  51.0   1  INTJ  91.297791
20  id21  90.0   부산  62.0   1  ISFP  29.269869

In [25]:
df.f1.mean()

np.float64(65.52)